postmanecho-performance.yml
config:
  target: "https://postman-echo.com/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Load Test
  payload:
    - path: "keywords.csv"
      fields:
        - "keyword1"
      order: sequence
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 600
    conditions:
      - expression: vusers.failed == 0
      - expression: "http.request_rate >= 2 and http.response_time.max < 1000"
scenarios:
  - name: Testing GET and POST endpoints
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post?param1={{ keyword1 }}"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.host"
              as: "host"
            - json: "$.headers.x-forwarded-port"
              as: "forwardedPort"
            - json: "$.headers.user-agent"
              as: "userAgent"
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"
      - log: "X-forwarded-port value from response is: {{forwardedPort}}"
      - log: "User-Agent value from response is: {{userAgent}}"